; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c7-s3-p13-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 c4 c5 c6 
          t0 t1 t2 t3 t4 t5 t6 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 l3-0 l3-1 l3-2 l4-0 l4-1 l4-2 l5-0 l5-1 l5-2 l6-0 l6-1 l6-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (CITY c6)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (LOCATION l6-0)
    (in-city  l6-0 c6)
    (LOCATION l6-1)
    (in-city  l6-1 c6)
    (LOCATION l6-2)
    (in-city  l6-2 c6)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (AIRPORT l6-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (at t0 l0-2)
    (at t1 l1-1)
    (at t2 l2-0)
    (at t3 l3-0)
    (at t4 l4-0)
    (at t5 l5-2)
    (at t6 l6-1)
    (at p0 l0-2)
    (at p1 l3-1)
    (at p2 l2-2)
    (at p3 l6-2)
    (at p4 l1-1)
    (at p5 l0-0)
    (at p6 l6-0)
    (at p7 l2-0)
    (at p8 l1-0)
    (at p9 l6-1)
    (at p10 l1-0)
    (at p11 l5-1)
    (at p12 l0-0)
    (at a0 l1-0)
    (at a1 l4-0)
    (at a2 l3-0)
)
(:goal
    (and
        (at p0 l0-0)
        (at p1 l2-1)
        (at p2 l0-0)
        (at p3 l2-0)
        (at p4 l4-0)
        (at p5 l0-0)
        (at p6 l2-1)
        (at p7 l0-0)
        (at p8 l6-1)
        (at p9 l2-2)
        (at p10 l6-2)
        (at p11 l1-2)
        (at p12 l1-2)
    )
)

  (:constraints
    (and
      (always (not (in p0 a0)))
      (always (not (in p0 a1)))
      (always (not (in p0 a2)))
      (always (not (in p5 a0)))
      (always (not (in p5 a1)))
      (always (not (in p5 a2)))
    )
  )
)

; plan
1. (drive-truck t5 l5-2 l5-1 c5)
   deleted: (at t5 l5-2)
   added: (at t5 l5-1)
   goals met: 1 of 13
2. (load-airplane p8 a0 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 a0)
   goals met: 1 of 13
3. (load-airplane p10 a0 l1-0)
   deleted: (at p10 l1-0)
   added: (in p10 a0)
   goals met: 1 of 13
4. (load-truck p9 t6 l6-1)
   deleted: (at p9 l6-1)
   added: (in p9 t6)
   goals met: 1 of 13
5. (load-truck p4 t1 l1-1)
   deleted: (at p4 l1-1)
   added: (in p4 t1)
   goals met: 1 of 13
6. (load-truck p0 t0 l0-2)
   deleted: (at p0 l0-2)
   added: (in p0 t0)
   goals met: 1 of 13
7. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 1 of 13
8. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 1 of 13
9. (fly-airplane a1 l4-0 l6-0)
   deleted: (at a1 l4-0)
   added: (at a1 l6-0)
   goals met: 1 of 13
10. (fly-airplane a2 l3-0 l6-0)
   deleted: (at a2 l3-0)
   added: (at a2 l6-0)
   goals met: 1 of 13
11. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 1 of 13
12. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 1 of 13
13. (load-truck p11 t5 l5-1)
   deleted: (at p11 l5-1)
   added: (in p11 t5)
   goals met: 1 of 13
14. (drive-truck t6 l6-1 l6-2 c6)
   deleted: (at t6 l6-1)
   added: (at t6 l6-2)
   goals met: 1 of 13
15. (load-truck p1 t3 l3-1)
   deleted: (at p1 l3-1)
   added: (in p1 t3)
   goals met: 1 of 13
16. (load-truck p2 t2 l2-2)
   deleted: (at p2 l2-2)
   added: (in p2 t2)
   goals met: 1 of 13
17. (load-airplane p6 a1 l6-0)
   deleted: (at p6 l6-0)
   added: (in p6 a1)
   goals met: 1 of 13
18. (fly-airplane a2 l6-0 l5-0)
   deleted: (at a2 l6-0)
   added: (at a2 l5-0)
   goals met: 1 of 13
19. (drive-truck t5 l5-1 l5-0 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 1 of 13
20. (unload-truck p0 t0 l0-0)
   deleted: (in p0 t0)
   added: (at p0 l0-0)
   goals met: 2 of 13
21. (load-truck p3 t6 l6-2)
   deleted: (at p3 l6-2)
   added: (in p3 t6)
   goals met: 2 of 13
22. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 2 of 13
23. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 2 of 13
24. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 2 of 13
25. (unload-truck p11 t5 l5-0)
   deleted: (in p11 t5)
   added: (at p11 l5-0)
   goals met: 2 of 13
26. (unload-truck p1 t3 l3-0)
   deleted: (in p1 t3)
   added: (at p1 l3-0)
   goals met: 2 of 13
27. (unload-truck p2 t2 l2-0)
   deleted: (in p2 t2)
   added: (at p2 l2-0)
   goals met: 2 of 13
28. (drive-truck t6 l6-2 l6-0 c6)
   deleted: (at t6 l6-2)
   added: (at t6 l6-0)
   goals met: 2 of 13
29. (unload-truck p4 t1 l1-0)
   deleted: (in p4 t1)
   added: (at p4 l1-0)
   goals met: 2 of 13
30. (unload-truck p9 t6 l6-0)
   deleted: (in p9 t6)
   added: (at p9 l6-0)
   goals met: 2 of 13
31. (unload-truck p3 t6 l6-0)
   deleted: (in p3 t6)
   added: (at p3 l6-0)
   goals met: 2 of 13
32. (load-airplane p4 a0 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a0)
   goals met: 2 of 13
33. (load-airplane p11 a2 l5-0)
   deleted: (at p11 l5-0)
   added: (in p11 a2)
   goals met: 2 of 13
34. (fly-airplane a0 l1-0 l6-0)
   deleted: (at a0 l1-0)
   added: (at a0 l6-0)
   goals met: 2 of 13
35. (load-airplane p9 a1 l6-0)
   deleted: (at p9 l6-0)
   added: (in p9 a1)
   goals met: 2 of 13
36. (load-airplane p3 a1 l6-0)
   deleted: (at p3 l6-0)
   added: (in p3 a1)
   goals met: 2 of 13
37. (fly-airplane a2 l5-0 l2-0)
   deleted: (at a2 l5-0)
   added: (at a2 l2-0)
   goals met: 2 of 13
38. (unload-airplane p8 a0 l6-0)
   deleted: (in p8 a0)
   added: (at p8 l6-0)
   goals met: 2 of 13
39. (unload-airplane p10 a0 l6-0)
   deleted: (in p10 a0)
   added: (at p10 l6-0)
   goals met: 2 of 13
40. (fly-airplane a1 l6-0 l2-0)
   deleted: (at a1 l6-0)
   added: (at a1 l2-0)
   goals met: 2 of 13
41. (load-airplane p7 a2 l2-0)
   deleted: (at p7 l2-0)
   added: (in p7 a2)
   goals met: 2 of 13
42. (load-airplane p2 a2 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 a2)
   goals met: 2 of 13
43. (fly-airplane a0 l6-0 l4-0)
   deleted: (at a0 l6-0)
   added: (at a0 l4-0)
   goals met: 2 of 13
44. (load-truck p8 t6 l6-0)
   deleted: (at p8 l6-0)
   added: (in p8 t6)
   goals met: 2 of 13
45. (load-truck p10 t6 l6-0)
   deleted: (at p10 l6-0)
   added: (in p10 t6)
   goals met: 2 of 13
46. (fly-airplane a2 l2-0 l0-0)
   deleted: (at a2 l2-0)
   added: (at a2 l0-0)
   goals met: 2 of 13
47. (unload-airplane p9 a1 l2-0)
   deleted: (in p9 a1)
   added: (at p9 l2-0)
   goals met: 2 of 13
48. (unload-airplane p6 a1 l2-0)
   deleted: (in p6 a1)
   added: (at p6 l2-0)
   goals met: 2 of 13
49. (unload-airplane p3 a1 l2-0)
   deleted: (in p3 a1)
   added: (at p3 l2-0)
   goals met: 3 of 13
50. (drive-truck t6 l6-0 l6-2 c6)
   deleted: (at t6 l6-0)
   added: (at t6 l6-2)
   goals met: 3 of 13
51. (unload-airplane p4 a0 l4-0)
   deleted: (in p4 a0)
   added: (at p4 l4-0)
   goals met: 4 of 13
52. (unload-airplane p7 a2 l0-0)
   deleted: (in p7 a2)
   added: (at p7 l0-0)
   goals met: 5 of 13
53. (unload-airplane p2 a2 l0-0)
   deleted: (in p2 a2)
   added: (at p2 l0-0)
   goals met: 6 of 13
54. (load-airplane p12 a2 l0-0)
   deleted: (at p12 l0-0)
   added: (in p12 a2)
   goals met: 6 of 13
55. (load-truck p9 t2 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 t2)
   goals met: 6 of 13
56. (load-truck p6 t2 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 t2)
   goals met: 6 of 13
57. (fly-airplane a1 l2-0 l3-0)
   deleted: (at a1 l2-0)
   added: (at a1 l3-0)
   goals met: 6 of 13
58. (unload-truck p10 t6 l6-2)
   deleted: (in p10 t6)
   added: (at p10 l6-2)
   goals met: 7 of 13
59. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 7 of 13
60. (load-airplane p1 a1 l3-0)
   deleted: (at p1 l3-0)
   added: (in p1 a1)
   goals met: 7 of 13
61. (fly-airplane a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 7 of 13
62. (drive-truck t6 l6-2 l6-1 c6)
   deleted: (at t6 l6-2)
   added: (at t6 l6-1)
   goals met: 7 of 13
63. (unload-airplane p12 a2 l1-0)
   deleted: (in p12 a2)
   added: (at p12 l1-0)
   goals met: 7 of 13
64. (unload-airplane p11 a2 l1-0)
   deleted: (in p11 a2)
   added: (at p11 l1-0)
   goals met: 7 of 13
65. (unload-truck p9 t2 l2-2)
   deleted: (in p9 t2)
   added: (at p9 l2-2)
   goals met: 8 of 13
66. (fly-airplane a1 l3-0 l2-0)
   deleted: (at a1 l3-0)
   added: (at a1 l2-0)
   goals met: 8 of 13
67. (unload-truck p8 t6 l6-1)
   deleted: (in p8 t6)
   added: (at p8 l6-1)
   goals met: 9 of 13
68. (load-truck p12 t1 l1-0)
   deleted: (at p12 l1-0)
   added: (in p12 t1)
   goals met: 9 of 13
69. (load-truck p11 t1 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 t1)
   goals met: 9 of 13
70. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 9 of 13
71. (unload-airplane p1 a1 l2-0)
   deleted: (in p1 a1)
   added: (at p1 l2-0)
   goals met: 9 of 13
72. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 9 of 13
73. (unload-truck p6 t2 l2-1)
   deleted: (in p6 t2)
   added: (at p6 l2-1)
   goals met: 10 of 13
74. (unload-truck p12 t1 l1-2)
   deleted: (in p12 t1)
   added: (at p12 l1-2)
   goals met: 11 of 13
75. (unload-truck p11 t1 l1-2)
   deleted: (in p11 t1)
   added: (at p11 l1-2)
   goals met: 12 of 13
76. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 12 of 13
77. (load-truck p1 t2 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 t2)
   goals met: 12 of 13
78. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 12 of 13
79. (unload-truck p1 t2 l2-1)
   deleted: (in p1 t2)
   added: (at p1 l2-1)
   goals met: 13 of 13
